spec/fixtures/stripe_webhooks/charge.dispute.created.json

{
  "id": "evt_1Y88dEBCJIIhvMWmZItuOHT4",
  "object": "event",
  "api_version": "2015-04-07",
  "created": 1596480212,
  "data": {
    "object": {
      "id": "dp_05RsQX2eZvKYlo2C0FRTGSSA",
      "object": "dispute",
      "amount": 80000,
      "balance_transaction": null,
      "balance_transactions": [

      ],
      "charge": "ch_1Y7zzfBCJIIhvMWmSiNWrPAC",
      "created": 1596429790,
      "currency": "usd",
      "evidence": {
        "access_activity_log": null,
        "billing_address": "54915",
        "cancellation_policy": null,
        "cancellation_policy_disclosure": null,
        "cancellation_rebuttal": null,
        "customer_communication": null,
        "customer_email_address": "penelope@penelope.yorkie",
        "customer_name": "Penelope Schultz",
        "customer_purchase_ip": "1.1.1.1",
        "customer_signature": null,
        "duplicate_charge_documentation": null,
        "duplicate_charge_explanation": null,
        "duplicate_charge_id": null,
        "product_description": null,
        "receipt": null,
        "refund_policy": null,
        "refund_policy_disclosure": null,
        "refund_refusal_explanation": null,
        "service_date": null,
        "service_documentation": null,
        "shipping_address": null,
        "shipping_carrier": null,
        "shipping_date": null,
        "shipping_documentation": null,
        "shipping_tracking_number": null,
        "uncategorized_file": null,
        "uncategorized_text": null
      },
      "evidence_details": {
        "due_by": 1597881599,
        "has_evidence": false,
        "past_due": false,
        "submission_count": 0
      },
      "is_charge_refundable": false,
      "livemode": true,
      "metadata": {
      },
      "payment_intent": null,
      "reason": "duplicate",
      "status": "needs_response"
    }
  },
  "livemode": true,
  "pending_webhooks": 0,
  "request": "_____",
  "type": "charge.dispute.created"
}